Reports/Гражданство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Гражданство</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лига</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Топ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Гражданство/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Команда) Тогда
		СхемаКомпоновкиДанных	= ПолучитьМакет("СхемаКоманда");
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Команда",	Команда);
	Иначе
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Лига",	Лига);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Топ",	?(Лига.ОлимпийскаяСистема, Ложь, Топ));
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
КонецПроцедуры
